# Chapter 6 - Data Loading, Storage and File Formats

*Page 167*

## 6.1 Reading and Writing Data in Text Format

In [1]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [2]:
import pandas as pd
import os

def pj(file):
    '''
    function to join path
    file = file in example folder
    '''
    path = '/home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples'
    return os.path.join(path, file)

def pjd(file):
    '''
    function to join path
    file = file in example folder
    '''
    path = '/home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/datasets'
    return os.path.join(path, file)
    

df = pd.read_csv(pj('ex1.csv'))
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
pd.read_table(pj('ex1.csv'), sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_csv(pj('ex2.csv'), header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [5]:
pd.read_csv(pj('ex2.csv'), names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
names = ['a', 'b', 'c', 'd', 'message']

pd.read_csv(pj('ex2.csv'), names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [8]:
parsed = pd.read_csv(pj('csv_mindex.csv'), index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [9]:
list(open(pj('ex3.txt')))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [10]:
results = pd.read_table(pj('ex3.txt'), sep='\s+')
results

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [11]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
pd.read_csv(pj('ex4.csv'), skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [14]:
results = pd.read_csv(pj('ex5.csv'))
results

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [15]:
pd.isnull(results)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [16]:
results.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [17]:
result = pd.read_csv(pj('ex5.csv'), na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [18]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [19]:
pd.read_csv(pj('ex5.csv'), na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading Text Files in Pieces

In [20]:
pd.options.display.max_rows = 10

In [21]:
results = pd.read_csv(pj('ex6.csv'))
results

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [22]:
pd.read_csv(pj('ex6.csv'), nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [23]:
chunker = pd.read_csv(pj('ex6.csv'), chunksize=1000)
chunker

tot = pd.Series([],dtype='float64')

for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

### Writing Data to Text Format

In [24]:
data = pd.read_csv(pj('ex5.csv'))
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [25]:
data.to_csv((pj('out.csv')))

In [26]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [27]:
import sys
data.to_csv(sys.stdout, sep='|') #sys.stdout pring the answer out into the console (rather than into a file)

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [28]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [29]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [30]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [31]:
dates = pd.date_range('1/1/2000', periods=7)

In [32]:
import numpy as np

ts = pd.Series(np.arange(7), index=dates,)
ts.to_csv(pj('tseries0.csv'))

In [33]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/tseries0.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Woring with Delimted Formats

In [34]:
!cat /home/shivan/JupyterlabProjects/PythonForDataAnalysis/examples/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [35]:
import csv
f = open(pj('ex7.csv'))

reader = csv.reader(f)

for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [36]:
with open(pj('ex7.csv')) as f:
    lines = list(csv.reader(f))
    
header, values = lines[0], lines[1:]

data_dict = {h: v for h, v in zip(header, zip(*values))}

data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [37]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

with open(pj('ex7.csv')) as f:    
    reader = csv.reader(f, dialect=my_dialect)
    reader

In [38]:
with open(pj('ex7.csv')) as f:    
    reader = csv.reader(f, delimiter='|')
    reader

In [39]:
f.close()

### JSON Data

In [40]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [41]:
import json
results = json.loads(obj)
results

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [42]:
asjson = json.dumps(results)

In [43]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [44]:
siblings = pd.DataFrame(results['siblings'],columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [45]:
!cat ./examples/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [46]:
data = pd.read_json(pj('example.json'))
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### XML and HTML: Web Scraping 

installed `lxml`, `beatifulsoup4`, `html5lib`

In [47]:
tables = pd.read_html(pj('fdic_failed_bank_list.html'))

In [48]:
len(tables)
#tables

1

In [49]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [50]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [51]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

#### Parsing XML with lxml.objectify

In [52]:
from lxml import objectify

path = pjd('mta_perf/Performance_MNR.xml')
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [53]:
data = []

In [54]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
        data.append(el_data)

In [55]:
perf = pd.DataFrame(data)
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95,96.9,95,96.9

In [56]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
strIO = StringIO(tag)
strIO
root = objectify.parse(strIO).getroot()

In [57]:
root

In [58]:
root.get('href')

'http://www.google.com'

In [59]:
root.text

'Google'

## 6.2 Binary Data Formats
*Page 183*

serialization

In [60]:
frame = pd.read_csv(pj('ex1.csv'))

In [61]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [62]:
frame.to_pickle(pj('frame_pickle_shiv')) #pickle should be used to short term as may deprecate in the future

In [63]:
pd.read_pickle(pj('frame_pickle_shiv'))

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### Using HDF5 Format

In [64]:
frame = pd.DataFrame({'a': np.random.randn(100)})
frame.head()

          a
0 -0.074204
1 -1.033624
2  0.761881
3  0.798284
4  0.351257

In [65]:
store = pd.HDFStore('mydata.h5')

In [66]:
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [67]:
store['obj1']

           a
0  -0.074204
1  -1.033624
2   0.761881
3   0.798284
4   0.351257
..       ...
95 -0.296993
96  0.038218
97  0.515388
98  1.377552
99 -0.581844

[100 rows x 1 columns]

In [68]:
store.put('obj2', frame, format='table')

In [69]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -1.687491
11 -2.019613
12  0.177990
13  0.397329
14 -0.537736
15  0.846169

In [70]:
store.close()

In [71]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [72]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.074204
1 -1.033624
2  0.761881
3  0.798284
4  0.351257

### Reading Microdoft Excel Files

In [75]:
xlsx = pd.ExcelFile(pj('ex1.xlsx'))

pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [79]:
frame = pd.read_excel(pj('ex1.xlsx'), 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [85]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

frame.to_excel(writer, 'Sheet1')

writer.save()

In [86]:
frame.to_excel('examples/ex2_.xlsx')

### 6.3 Interacting with Web APIs
*page 187*

In [88]:
import requests

url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

res = requests.get(url)
res.raise_for_status()
res

In [89]:
data = res.json()
data[0]['title']

'REF: remove ObjectBlock._replace_single'

In [90]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,37710,REF: remove ObjectBlock._replace_single,[],open
1,37709,QST: panda fillna SettingWithCopyWarning:,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
2,37707,Bug in loc raised Error when non integer inter...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
3,37706,BUG: Fix return of missing values when applyin...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
4,37705,BUG: read_html - file path cannot be pathlib.P...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,37661,BUG: RollingGroupby when groupby key is in the...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,37656,ENH: option to plot data points on top of boxplot,[],open
27,37655,TST: split up tests/plotting/test_frame.py int...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
28,37654,ENH: support zoneinfo tzinfo objects,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,37653,ENH: PyPy3 testing,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open

### 6.4 Interacting with Databases
*Page 188*

In [93]:
import sqlite3

query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
    c REAL, d INTEGER
    );"""

con = sqlite3.connect('mydata.sqlite')
con.execute(query)

In [94]:
con.commit()

In [95]:
data = [('Alanta', 'Georgia', 1.25, 6),
       ('Tallahasse', 'FLorida', 2.6, 3),
       ('Sacromento', 'California', 1.7, 5)]

In [99]:
stmt = 'INSERT INTO test VALUES(?, ?, ?, ?)'

In [100]:
con.executemany(stmt, data)

In [101]:
con.commit()

In [102]:
cursor = con.execute('select * from test')

In [103]:
rows = cursor.fetchall()

In [104]:
rows

[('Alanta', 'Georgia', 1.25, 6),
 ('Tallahasse', 'FLorida', 2.6, 3),
 ('Sacromento', 'California', 1.7, 5)]

In [105]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [107]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

            a           b     c  d
0      Alanta     Georgia  1.25  6
1  Tallahasse     FLorida  2.60  3
2  Sacromento  California  1.70  5

In [109]:
import sqlalchemy as sqla

db = sqla.create_engine('sqlite:///mydata.sqlite')

pd.read_sql('select * from test', db)

            a           b     c  d
0      Alanta     Georgia  1.25  6
1  Tallahasse     FLorida  2.60  3
2  Sacromento  California  1.70  5